Core/src/src/DataProcessors/AzRyJiraИЗарплата/AzRyJiraИЗарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AzRyJiraИЗарплата</name>
  <attributes>
    <name>КоличествоРабочихДнейВМесяце</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтбора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьСотрудники</name>
    <attributes>
      <name>Сотрудники</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗагрузкаПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТарифЗаЧас</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабличнаяЧастьРазница</name>
    <attributes>
      <name>Сотрудники</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифЗаЧас</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Worklogs</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>WorklogsSum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Разница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Core/src/src/Documents/Увольнение/Увольнение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Увольнение</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисленияИУдержания</registerRecords>
  <registerRecords>InformationRegister.Сотрудники</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеУвольнения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтозватьПравоПодписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/Documents/ЗаданиеНаРаботу/ЗаданиеНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаРаботу</name>
  <basedOn>Document.Событие</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.ЗаданияНаРаботу</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаданиеНаРаботу</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>КалендарьСотрудника</name>
    <type>
      <types>CatalogRef.КалендариСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьМОЛ</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоложениеВидаРабот</name>
    <comment>Положение вида работ (в шапке, в списке)</comment>
    <type>
      <types>EnumRef.ПоложениеРеквизитаНаФорме</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>DocumentRef.Событие</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.СостоянияСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyJiraSelectVersion</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytempoWorklogId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказчик</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Трудоемкость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyПроект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/DataProcessors/AzRyJiraИЗарплата/Forms/Форма/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

&НаКлиенте
Перем ЗарплатаСотрудниковСТ;

&НаСервере
Перем КРДВ;

&НаСервере
Перем КРЧ;


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура СформироватьНаСервер()
	
	СформироватьСервер();
	
КонецПроцедуры	

&НаСервере
Процедура СформироватьСервер(Результат = Неопределено)
	
	КРДВ = AzRyFunctions.КоличествоРабочихДнейВМесяце(Год(Объект.ДатаОтбора), НачалоМесяца(Объект.ДатаОтбора), КонецМесяца(Объект.ДатаОтбора));
	КРЧ  = Справочники.AzRyНастройки.КоличествоРабочихЧасов.Значение;
	Объект.КоличествоРабочихДнейВМесяце = КРДВ;
	Объект.КоличествоРабочихЧасов       = КРДВ * КРЧ;
	
	Если Результат = Неопределено Тогда 
		
		РезультатТЗ = AzRyFunctions.ВсеАктивныеСотрудники(Объект.ДатаОтбора, Справочники.AzRyНастройки.НачислениеТарифнаяСтавка.Значение);
		
		СотрудникиИзДжира = РеквизитФормыВЗначение("Объект").СотрудникиИзДжира(Объект.ДатаОтбора);		
		
		//// FOR DEBUG --
		//СотрудникиИзДжира = Новый СписокЗначений;
		//СотрудникиИзДжира.Добавить(Справочники.Сотрудники.НайтиПоКоду("0000000147"));  //თეო
		//СотрудникиИзДжира.Добавить(Справочники.Сотрудники.НайтиПоКоду("000000109"));
		//СотрудникиИзДжира.Добавить(Справочники.Сотрудники.НайтиПоКоду("000000075")); // ზურაბ ჯანიაშვილი
		//СотрудникиИзДжира.Добавить(Справочники.Сотрудники.НайтиПоКоду("000000045")); //მიხეილ აბულაშვილი  
		//СотрудникиИзДжира.Добавить(Справочники.Сотрудники.НайтиПоКоду("000000025")); //mamulashvili 
		//СотрудникиИзДжира.Добавить(Справочники.Сотрудники.НайтиПоКоду("000000049")); // Ника 
		//СотрудникиИзДжира.Добавить(Справочники.Сотрудники.НайтиПоКоду("000000406")); // akaki 
		//СотрудникиИзДжира.Добавить(Справочники.Сотрудники.НайтиПоКоду("000000471")); // akaki 
		РеквизитФормыВЗначение("Объект").ФилтрТЗ(РезультатТЗ, "Сотрудник", СотрудникиИзДжира);
		//// FOR DEBUG --
		
		НДФЛ = Справочники.AzRyНастройки.УдержаниеНДФЛ.Значение.СтавкаНДФЛ/100;
		
		// 2) 
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст = "ВЫБРАТЬ
		               |	АктивныеСотрудники.Сотрудник КАК Сотрудник,
		               |	АктивныеСотрудники.Организация КАК Организация,
		               |	АктивныеСотрудники.Сумма КАК Сумма
		               |ПОМЕСТИТЬ ВременнаяТаблицаАктивныеСотрудники
		               |ИЗ
		               |	&АктивныеСотрудники КАК АктивныеСотрудники
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЗаданияНаРаботу.Сотрудник КАК Сотрудник,
		               |	ЗаданияНаРаботу.ЗаказПокупателя.Организация КАК Организация,
		               |	ЗаданияНаРаботу.AzRyПроект КАК ЗаказПокупателяПроект,
		               |	ЗаданияНаРаботу.ЗагрузкаПлан КАК ЗагрузкаПлан,
		               |	0 КАК РазницаВСумме,
		               |	ЗаданияНаРаботу.Организация КАК ОрганизацияЗаданияНаРаботу,
		               |	ЗаданияНаРаботу.Регистратор КАК Регистратор,
		               |	ЗаданияНаРаботу.ЗаказПокупателя КАК ЗаказПокупателя,
		               |	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателяНовый,
		               |	&Налог КАК Налог,
		               |	ЛОЖЬ КАК Статус,
		               |	ВЫРАЗИТЬ(ЗаданияНаРаботу.ЗагрузкаПлан * (ВЫРАЗИТЬ(ПлановыеНачисленияИУдержанияСрезПоследних_ТарифОрг.Сумма / &КРДВ / &КЧР КАК ЧИСЛО(15, 4))) КАК ЧИСЛО(15, 4)) КАК ЗагрузкаПланВСумме,
		               |	ЕСТЬNULL(ВЫРАЗИТЬ(ПлановыеНачисленияИУдержанияСрезПоследних_ТарифОрг.Сумма / ЗаданияНаРаботу.ЗагрузкаПлан КАК ЧИСЛО(15, 4)), 0) КАК ТарифЗаЧас,
		               |	ЕСТЬNULL(ПлановыеНачисленияИУдержанияСрезПоследних.Сумма, 0) КАК Тариф,
		               |	ЕСТЬNULL(ПлановыеНачисленияИУдержанияСрезПоследних_ТарифОрг.Сумма, 0) КАК ТарифПоОрг,
		               |	0 КАК ЗагрузкаПланТребуется,
		               |	0 КАК ЗагрузкаПланТребуетсяДобавить,
		               |	""Строка"" КАК Строка
		               |ПОМЕСТИТЬ ТЗ1
		               |ИЗ
		               |	РегистрНакопления.ЗаданияНаРаботу КАК ЗаданияНаРаботу
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник КАК Сотрудник,
		               |			СУММА(ЕСТЬNULL(ПлановыеНачисленияИУдержанияСрезПоследних.Сумма, 0)) КАК Сумма
		               |		ИЗ
		               |			РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(&Дата, ВидНачисленияУдержания = &ВидНачисленияУдержания) КАК ПлановыеНачисленияИУдержанияСрезПоследних
		               |		ГДЕ
		               |			ПлановыеНачисленияИУдержанияСрезПоследних.Актуальность
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник) КАК ПлановыеНачисленияИУдержанияСрезПоследних
		               |		ПО ЗаданияНаРаботу.Сотрудник = ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(
		               |				&Дата,
		               |				ВидНачисленияУдержания = &ВидНачисленияУдержания
		               |					И ТИПЗНАЧЕНИЯ(Регистратор) <> ТИП(Документ.Увольнение)) КАК ПлановыеНачисленияИУдержанияСрезПоследних_ТарифОрг
		               |		ПО ЗаданияНаРаботу.Сотрудник = ПлановыеНачисленияИУдержанияСрезПоследних_ТарифОрг.Сотрудник
		               |			И ЗаданияНаРаботу.Организация = ПлановыеНачисленияИУдержанияСрезПоследних_ТарифОрг.Организация
		               |ГДЕ
		               |	ЗаданияНаРаботу.Период МЕЖДУ &Период1 И &Период2
		               |	И ЗаданияНаРаботу.Сотрудник В
		               |			(ВЫБРАТЬ
		               |				ВременнаяТаблицаАктивныеСотрудники.Сотрудник
		               |			ИЗ
		               |				ВременнаяТаблицаАктивныеСотрудники)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТЗ2.Сотрудник КАК Сотрудник,
		               |	ТЗ2.Организация КАК Организация,
		               |	ТЗ2.ОрганизацияЗаданияНаРаботу КАК ОрганизацияЗаданияНаРаботу,
		               |	ТЗ2.ЗаказПокупателяПроект КАК ЗаказПокупателяПроект,
		               |	ТЗ2.ЗагрузкаПлан КАК ЗагрузкаПлан,
		               |	ТЗ2.РазницаВСумме КАК РазницаВСумме,
		               |	ТЗ2.Налог КАК Налог,
		               |	ТЗ2.Регистратор КАК Регистратор,
		               |	ТЗ2.ЗаказПокупателя КАК ЗаказПокупателя,
		               |	ТЗ2.ЗаказПокупателяНовый КАК ЗаказПокупателяНовый,
		               |	ТЗ2.Статус КАК Статус,
		               |	ТЗ2.ЗагрузкаПланВСумме КАК ЗагрузкаПланВСумме,
		               |	ТЗ2.ТарифЗаЧас КАК ТарифЗаЧас,
		               |	ТЗ2.Тариф КАК Тариф,
		               |	ВЫБОР
		               |		КОГДА ТЗ2.ТарифПоОрг = 0
		               |			ТОГДА ЕСТЬNULL(ВременнаяТаблицаАктивныеСотрудники.Сумма, 0)
		               |		ИНАЧЕ ТЗ2.ТарифПоОрг
		               |	КОНЕЦ КАК ТарифПоОрг,
		               |	ТЗ2.ЗагрузкаПланТребуется КАК ЗагрузкаПланТребуется,
		               |	ТЗ2.ЗагрузкаПланТребуетсяДобавить КАК ЗагрузкаПланТребуетсяДобавить,
		               |	ВременнаяТаблицаАктивныеСотрудники.Сотрудник КАК Сотрудник1,
		               |	ВременнаяТаблицаАктивныеСотрудники.Организация КАК Организация1,
		               |	ВременнаяТаблицаАктивныеСотрудники.Сумма КАК Сумма1,
		               |	ТЗ2.Строка КАК Строка
		               |ИЗ
		               |	ТЗ1 КАК ТЗ2
		               |		ПОЛНОЕ СОЕДИНЕНИЕ ВременнаяТаблицаАктивныеСотрудники КАК ВременнаяТаблицаАктивныеСотрудники
		               |		ПО ТЗ2.Сотрудник = ВременнаяТаблицаАктивныеСотрудники.Сотрудник
		               |			И ТЗ2.ОрганизацияЗаданияНаРаботу = ВременнаяТаблицаАктивныеСотрудники.Организация
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Сотрудник,
		               |	ТЗ2.Организация";
		
		Запрос.УстановитьПараметр("АктивныеСотрудники", РезультатТЗ);
		Запрос.УстановитьПараметр("Период1", НачалоМесяца(Объект.ДатаОтбора));
		Запрос.УстановитьПараметр("Период2", КонецМесяца(Объект.ДатаОтбора));
		Запрос.УстановитьПараметр("Сотрудник", РезультатТЗ.ВыгрузитьКолонку("Сотрудник"));
		Запрос.УстановитьПараметр("Дата", КонецМесяца(Объект.ДатаОтбора));
		Запрос.УстановитьПараметр("ВидНачисленияУдержания", Справочники.AzRyНастройки.НачислениеТарифнаяСтавка.Значение); 
		Запрос.УстановитьПараметр("Налог", Справочники.AzRyНастройки.УдержаниеНДФЛ.Значение);
		Запрос.УстановитьПараметр("КРДВ", КРДВ);
		Запрос.УстановитьПараметр("КЧР", КРЧ);
		
		Результат = Запрос.Выполнить().Выгрузить();
		ОбработкаТаблицы(Результат);
		
		//// FOR DEBUG --
		РеквизитФормыВЗначение("Объект").ФилтрТЗ(Результат, "Сотрудник", СотрудникиИзДжира);
		//// FOR DEBUG --
			
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ2.ЗаказПокупателяПроект,
	               |	ТЗ2.Сотрудник КАК Сотрудник,
	               |	ТЗ2.Организация КАК Организация,
	               |	ТЗ2.ОрганизацияЗаданияНаРаботу КАК ОрганизацияЗаданияНаРаботу,
	               |	ТЗ2.ЗагрузкаПлан КАК ЗагрузкаПлан,
	               |	ТЗ2.ЗагрузкаПланВСумме КАК ЗагрузкаПланВСумме,
	               |	ТЗ2.РазницаВСумме КАК РазницаВСумме,
	               |	ТЗ2.Тариф,
	               |	ТЗ2.ТарифПоОрг КАК ТарифПоОрг,
	               |	ТЗ2.Налог,
	               |	ТЗ2.Регистратор,
	               |	ТЗ2.ТарифЗаЧас,
	               |	ТЗ2.ЗаказПокупателя КАК ЗаказПокупателя,
	               |	ТЗ2.ЗаказПокупателяНовый КАК ЗаказПокупателяНовый,
	               |	ТЗ2.Статус,
	               |	ТЗ2.ЗагрузкаПланТребуется,
	               |	ТЗ2.ЗагрузкаПланТребуетсяДобавить,
	               |	ТЗ2.НМ,
	               |	ТЗ2.Строка
	               |ПОМЕСТИТЬ ТЗ2
	               |ИЗ
	               |	&ТЗ КАК ТЗ2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ3.ЗаказПокупателяПроект,
	               |	ТЗ3.Сотрудник КАК Сотрудник,
	               |	ТЗ3.Организация КАК Организация,
	               |	ТЗ3.ОрганизацияЗаданияНаРаботу КАК ОрганизацияЗаданияНаРаботу,
	               |	ТЗ3.ЗагрузкаПлан КАК ЗагрузкаПлан,
	               |	ТЗ3.ЗагрузкаПланВСумме КАК ЗагрузкаПланВСумме,
	               |	ТЗ3.РазницаВСумме КАК РазницаВСумме,
	               |	ТЗ3.Тариф,
	               |	ТЗ3.ТарифПоОрг КАК ТарифПоОрг,
	               |	ТЗ3.Налог,
	               |	ТЗ3.Регистратор,
	               |	ТЗ3.ТарифЗаЧас,
	               |	ТЗ3.ЗаказПокупателя КАК ЗаказПокупателя,
	               |	ТЗ3.ЗаказПокупателяНовый КАК ЗаказПокупателяНовый,
	               |	ТЗ3.Статус,
	               |	ТЗ3.ЗагрузкаПланТребуется,
	               |	ТЗ3.ЗагрузкаПланТребуетсяДобавить,
	               |	ТЗ3.НМ,
	               |	ТЗ3.Строка,
	               |	ЛОЖЬ КАК Изменен,
				   |	0 КАК Н
	               |ИЗ
	               |	ТЗ2 КАК ТЗ3
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сотрудник,
	               |	Организация
	               |ИТОГИ
	               |	СУММА(ЗагрузкаПлан),
	               |	СУММА(ЗагрузкаПланВСумме),
	               |	СУММА(РазницаВСумме)
	               |ПО
	               |	Сотрудник,
	               |	ОрганизацияЗаданияНаРаботу,
	               |	ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("ТЗ", Результат);
		
	РезультатСИерархией = Запрос.Выполнить();
	ДеревоТЗ = РезультатСИерархией.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией); 
	
	Дерево = РеквизитФормыВЗначение("ДеревоЗначений");
	Дерево = ДеревоТЗ;
	Элементы.ДеревоЗначений.Обновить();
	
	Объект.ТабличнаяЧастьСотрудники.Очистить();
	Объект.ТабличнаяЧастьРазница.Очистить();
	
	Н = 0;
	Для каждого ТекДерево Из Дерево.Строки Цикл // თანამშრომლის ციკლი
		Н = Н + 1;
		ЗагрузкаПланТребуется = 0;
		КешТариф      = Новый Соответствие;
		КешТарифЗаЧас = Новый Соответствие;
		ТарифЗаЧас    = СуммаТарифаПоОрганизациям(ТекДерево); //ТекДерево.Строки[0].Строки[0].Строки[0].ТарифПоОрг / ТекДерево.ЗагрузкаПлан;  
		
		ТекДерево.Н = Н;
		ТекДерево.РазницаВСумме= Неопределено;
		Для каждого ТекДерево1 Из ТекДерево.Строки Цикл // ორგანიზაციის ციკლი
			// dajameba organizaciis mixedviT
			ТекДерево1.ТарифПоОрг = ТекДерево1.Строки[0].Строки[0].ТарифПоОрг;
			//ТекДерево1.ТарифЗаЧас = ТекДерево1.Строки[0].Строки[0].ТарифЗаЧас;
			ТекДерево1.ТарифЗаЧас = ТарифЗаЧас;
			
			КешТариф.Вставить(ТекДерево1.ОрганизацияЗаданияНаРаботу, ТекДерево1.Строки[0].Строки[0].ТарифПоОрг);
			КешТарифЗаЧас.Вставить(ТекДерево1.ОрганизацияЗаданияНаРаботу, ТекДерево1.Строки[0].Строки[0].ТарифЗаЧас);
			
			Для каждого ТекДерево2 Из ТекДерево1.Строки Цикл
				ТекДерево2.ТарифПоОрг         = ТекДерево2.Строки[0].ТарифПоОрг;
				//ТекДерево2.ТарифЗаЧас         = ТекДерево2.Строки[0].ТарифЗаЧас; 
				//ТекДерево2.Тариф              = ТекДерево2.Строки[0].Тариф;
				ТекДерево2.ТарифЗаЧас         = ТарифЗаЧас; 
				ТекДерево2.ЗагрузкаПланВСумме    = ТарифЗаЧас * ТекДерево2.ЗагрузкаПлан;
				ТекДерево2.ЗаказПокупателяПроект = ТекДерево2.Строки[0].ЗаказПокупателяПроект;
				ТекДерево2.ОрганизацияЗаданияНаРаботу           = ТекДерево2.Строки[0].ОрганизацияЗаданияНаРаботу;
				//ТекДерево2.РазницаВСумме 	     = ТекДерево2.ЗагрузкаПланВСумме - ТекДерево2.ТарифПоОрг; 
			КонецЦикла;
			
			ТекДерево1.ЗагрузкаПланТребуется         = ?(ТекДерево1.ТарифПоОрг=0, 0, Окр(ТекДерево1.ТарифПоОрг / ТекДерево1.ТарифЗаЧас, 4));
			ТекДерево1.ЗагрузкаПланТребуетсяДобавить = ТекДерево1.ЗагрузкаПланТребуется - ТекДерево1.ЗагрузкаПлан;
			ЗагрузкаПланТребуется = ЗагрузкаПланТребуется + ТекДерево1.ЗагрузкаПланТребуется;
		КонецЦикла;
		
		ТекДерево.ТарифПоОрг         	 = ИтогИзКеша(КешТариф);
		//ТекДерево.ТарифЗаЧас         	 = КешТарифЗаЧас[ТекДерево1.ОрганизацияЗаданияНаРаботу];
		ТекДерево.ТарифЗаЧас         	 = ТарифЗаЧас;
		ТекДерево.ЗагрузкаПланТребуется  = ЗагрузкаПланТребуется;
		////ТекДерево.ТарифЗаЧас    	 = ТекДерево.Строки[0].ТарифЗаЧас;
		////ТекДерево.Тариф              = ТекДерево.Строки[0].Тариф;
		//ТекДерево1.ЗагрузкаПланВСумме = ТекДерево1.ТарифЗаЧас * ТекДерево1.ЗагрузкаПлан; 
		ТекДерево.ЗагрузкаПланТребуетсяДобавить = Объект.КоличествоРабочихЧасов - ТекДерево.ЗагрузкаПлан;
		ТекДерево.РазницаВСумме 	 = ТекДерево.ЗагрузкаПланВСумме - ТекДерево.ТарифПоОрг;
		Если ТекДерево.ТарифПоОрг = 0 Тогда 
			Сообщить("№ " + Н + " - თანამშრომელს: (" + ТекДерево.Сотрудник.Наименование + ") არ გააჩნია ხელფასი!", СтатусСообщения.ОченьВажное);
		КонецЕсли;	
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоЗначений");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыСервер()
	
	КРЧ  = Справочники.AzRyНастройки.КоличествоРабочихЧасов.Значение;
	
	ТаблицаWorklogs = ТаблицаWorklogs();
	ТаблицаWorklogs.Колонки.Добавить("КоличествоСтрок");
	ТаблицаWorklogs.ЗаполнитьЗначения(1, "КоличествоСтрок"); 
	
	// Изменяем формат даты
	Для каждого ТекД Из ТаблицаWorklogs Цикл
		ТекД.ЗаданияНаРаботуДата = Дата(Год(ТекД.ЗаданияНаРаботуДата), Месяц(ТекД.ЗаданияНаРаботуДата), День(ТекД.ЗаданияНаРаботуДата));	
	КонецЦикла;
	
	ТаблицаWorklogsКопия = ТаблицаWorklogs.Скопировать();
	ТаблицаWorklogsКопия.Свернуть("Сотрудник, ЗаданияНаРаботуДата", "ЗагрузкаПлан, КоличествоСтрок");
	
	НачатьТранзакцию();
	Дерево = РеквизитФормыВЗначение("ДеревоЗначений");
	Для каждого ТекСТрока Из Дерево.Строки Цикл
		
		СуммаКомпенсаций = Объект.КоличествоРабочихЧасов - ТекСТрока.ЗагрузкаПлан;
		
		Если СуммаКомпенсаций <= 0 Тогда Продолжить; КонецЕсли;
		
		Отбор = Новый Структура();
		Отбор.Вставить("Сотрудник", ТекСТрока.Сотрудник);
		Строки = ТаблицаWorklogsКопия.НайтиСтроки(Отбор);
		Если Строки.Количество() > 0 Тогда
			
			МассивСоответствие = КоефициентВремени(Строки, СуммаКомпенсаций);
			
			Индекс = 0;
			ИндексСумма = СуммаКомпенсаций;
			Для каждого ТекМассив Из Строки Цикл
				Индекс = Индекс + 1;
				ОтборПоДням = Новый Структура();
				ОтборПоДням.Вставить("ЗаданияНаРаботуДата", ТекМассив.ЗаданияНаРаботуДата);
				ОтборПоДням.Вставить("Сотрудник", ТекМассив.Сотрудник);
				НаидСтроки = ТаблицаWorklogs.НайтиСтроки(ОтборПоДням);
				
				Если НаидСтроки.Количество() > 0 Тогда
					
					Попытка
						ДокументОбъект = НаидСтроки[0].Регистратор.ПолучитьОбъект();
						
						СтрПарам = МассивСоответствие.Получить(НаидСтроки[0].ЗаданияНаРаботуДата);
						
						ИндексСумма = ИндексСумма - СтрПарам.Сумма;
						
						Если Строки.Количество() = Индекс Тогда 
							ДокументОбъект.Работы[0].ДлительностьВЧасах = ДокументОбъект.Работы[0].ДлительностьВЧасах + СтрПарам.Сумма + ИндексСумма;
						Иначе 
							ДокументОбъект.Работы[0].ДлительностьВЧасах = ДокументОбъект.Работы[0].ДлительностьВЧасах + СтрПарам.Сумма;
						КонецЕсли;	
						
						ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);					
					Исключение
						ОтменитьТранзакцию();
						Сообщить(ОписаниеОшибки());
						Возврат;
					КонецПопытки;				
					
				КонецЕсли;	
				
			КонецЦикла;	
			
		КонецЕсли;					
	
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Функция ТаблицаWorklogs()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданияНаРаботу.Сотрудник КАК Сотрудник,
		|	ЗаданияНаРаботу.Регистратор.Дата КАК ЗаданияНаРаботуДата,
		|	ЗаданияНаРаботу.Организация КАК Организация,
		|	ЗаданияНаРаботу.ЗагрузкаПлан КАК ЗагрузкаПлан,
		|	ЗаданияНаРаботу.Регистратор
		|ИЗ
		|	РегистрНакопления.ЗаданияНаРаботу КАК ЗаданияНаРаботу
		|ГДЕ
		|	ЗаданияНаРаботу.Период МЕЖДУ &Период1 И &Период2
		|	И ЗаданияНаРаботу.Регистратор.Проведен = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	ЗаданияНаРаботуДата";

	Запрос.УстановитьПараметр("Период1", НачалоМесяца(Объект.ДатаОтбора));
	Запрос.УстановитьПараметр("Период2", КонецМесяца(Объект.ДатаОтбора));

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса;

КонецФункции

&НаСервере
Функция КоефициентВремени(МассивПарам, СуммаКомпенсаций)
	
	СуммаКоеф = 0;
	
	Соответствие = Новый Соответствие;
	
	СтруктураПарам = Новый Структура;
	СтруктураПарам.Вставить("Сотрудник", "");
	СтруктураПарам.Вставить("ЗагрузкаПлан", "");
	СтруктураПарам.Вставить("ЗаданияНаРаботуДата", "");
	СтруктураПарам.Вставить("КоличествоСтрок", "");
	СтруктураПарам.Вставить("Сумма", "");
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Сотрудник");
	ТЗ.Колонки.Добавить("ЗагрузкаПлан");
	ТЗ.Колонки.Добавить("ЗаданияНаРаботуДата");
	ТЗ.Колонки.Добавить("КоличествоСтрок");
	ТЗ.Колонки.Добавить("Сумма");
	
	Сумма = 0;
	Для каждого ТекМ Из МассивПарам Цикл
		Сумма = Сумма + ТекМ.ЗагрузкаПлан;
	КонецЦикла;
	
	ПарамСоответствие = Новый Соответствие;
	Для каждого ТекМассив Из МассивПарам Цикл
	
		СтруктураПарам = Новый Структура;
		СтруктураПарам.Вставить("Сотрудник", ТекМассив.Сотрудник);
		СтруктураПарам.Вставить("ЗагрузкаПлан", ТекМассив.ЗагрузкаПлан);
		СтруктураПарам.Вставить("ЗаданияНаРаботуДата", ТекМассив.ЗаданияНаРаботуДата);
		СтруктураПарам.Вставить("КоличествоСтрок", ТекМассив.КоличествоСтрок);
		СтруктураПарам.Вставить("Сумма", 0);
		
		Соответствие.Вставить(ТекМассив.ЗаданияНаРаботуДата, СтруктураПарам); 
		
		НовСтрока = ТЗ.Добавить();
		НовСтрока.Сотрудник           = ТекМассив.Сотрудник;
		НовСтрока.ЗагрузкаПлан        = ТекМассив.ЗагрузкаПлан;
		НовСтрока.ЗаданияНаРаботуДата = ТекМассив.ЗаданияНаРаботуДата;
		НовСтрока.КоличествоСтрок     = ТекМассив.КоличествоСтрок;
	
	КонецЦикла;
	
	СуммаКоеф = ТЗ.Итог("ЗагрузкаПлан");
	
	Для каждого ТекТЗ Из ТЗ Цикл
		
		ТекТЗ.Сумма = ТекТЗ.ЗагрузкаПлан / СуммаКоеф * СуммаКомпенсаций;
		
	КонецЦикла;
	
	Для каждого ТекТЗ Из Соответствие Цикл
		
		ТекТЗ.Значение.Сумма = Окр(ТекТЗ.Значение.ЗагрузкаПлан / СуммаКоеф * СуммаКомпенсаций, 4);  
		
	КонецЦикла;	
	
	Возврат Соответствие;
	
КонецФункции

&НаСервере
Процедура СохранениеДанныхWorklogsРазница()
	
	Если ПроверкаJiraWorklogsРазличия() Тогда
		
		НачатьТранзакцию();
		Попытка
			
			Для каждого ТекСтрока Из Объект.ТабличнаяЧастьРазница Цикл
				
				НаборЗаписей = РегистрыСведений.JiraWorklogsРазличия.СоздатьНаборЗаписей(); 
				
				НаборЗаписей.Отбор.Период.Установить(Объект.ДатаОтбора);
				НаборЗаписей.Отбор.Сотрудник.Установить(ТекСтрока.Сотрудники); 
				
				НоваяЗапись = НаборЗаписей.Добавить(); 
				НоваяЗапись.Период       = Объект.ДатаОтбора;
				НоваяЗапись.Сотрудник    = ТекСтрока.Сотрудники;
				
				НоваяЗапись.Зарплата               = ТекСтрока.Тариф;
				НоваяЗапись.ТарифЗаЧас             = ТекСтрока.ТарифЗаЧас;
				НоваяЗапись.КоличествоРабочихЧасов = Объект.КоличествоРабочихЧасов;
				НоваяЗапись.КоличествоРабочихДней  = Объект.КоличествоРабочихДнейВМесяце;
				НоваяЗапись.РазницаВЧасах          = ТекСтрока.Worklogs - Объект.КоличествоРабочихЧасов;
				НоваяЗапись.РазницаЗарплата        = (ТекСтрока.Worklogs - Объект.КоличествоРабочихЧасов) * ТекСтрока.ТарифЗаЧас;
				НоваяЗапись.РазницаВПроцентах      = 100 * (ТекСтрока.Worklogs - Объект.КоличествоРабочихЧасов) / Объект.КоличествоРабочихЧасов;
				
				НаборЗаписей.Записать(); 
				
			КонецЦикла;
			
		Исключение
			ОтменитьТранзакцию();
			Сообщить(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
КонецПроцедуры 	

&НаСервере
Функция ПроверкаJiraWorklogsРазличия()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	JiraWorklogsРазличия.Период,
		|	JiraWorklogsРазличия.Сотрудник,
		|	JiraWorklogsРазличия.Зарплата,
		|	JiraWorklogsРазличия.ТарифЗаЧас,
		|	JiraWorklogsРазличия.КоличествоРабочихЧасов,
		|	JiraWorklogsРазличия.КоличествоРабочихДней,
		|	JiraWorklogsРазличия.РазницаВЧасах,
		|	JiraWorklogsРазличия.РазницаЗарплата,
		|	JiraWorklogsРазличия.РазницаВПроцентах
		|ИЗ
		|	РегистрСведений.JiraWorklogsРазличия КАК JiraWorklogsРазличия
		|ГДЕ
		|	JiraWorklogsРазличия.Период МЕЖДУ &Период1 И &Период2";

	Запрос.УстановитьПараметр("Период1", НачалоМесяца(Объект.ДатаОтбора));
	Запрос.УстановитьПараметр("Период2", КонецМесяца(Объект.ДатаОтбора));

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат ?(РезультатЗапроса.Количество() = 0, Истина, Ложь);

КонецФункции

&НаСервере
Процедура ОбновытДокНачислениеИУдержаниеСервер()
	
	ДатаН = ДатаОбновленияДокументаНачисленийОт;
	ДатаК = ДатаОбновленияДокументаНачисленийДо;
	
	О = Обработки.AzRy_ОбновлениеДокументаНачислениеЗарплаты.Создать();
	О.ОбновытДокНачислениеИУдержаниеСервер(ДатаН, ДатаК);
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьДеревоЗначенийВТаблицуЗначений(Дерево, Таблица = Неопределено) Экспорт

    Если Таблица = Неопределено Тогда
        Таблица = Новый ТаблицаЗначений;
        Для Каждого Колонка Из Дерево.Колонки Цикл
            Таблица.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
        КонецЦикла;
    КонецЕсли;
    Для Каждого СтрокаДерева Из Дерево.Строки Цикл
        ЗаполнитьЗначенияСвойств(Таблица.Добавить(), СтрокаДерева);
        ВыгрузитьДеревоЗначенийВТаблицуЗначений(СтрокаДерева, Таблица);
    КонецЦикла;
    Возврат Таблица;

КонецФункции

&НаСервере
Функция ПолучитьВеткуПоПозицииСтроки(Дерево, НомерСтроки)
	Н = 0;
	Для Каждого Ветка Из Дерево.Строки Цикл
		Н = Н + 1;
		Если Н = НомерСтроки Тогда
            Возврат Ветка;
        Иначе
            НайденнаяСтрока = ПолучитьВеткуПоПозицииСтроки(Ветка, НомерСтроки);
            Если НайденнаяСтрока <> Неопределено Тогда
                Возврат НайденнаяСтрока;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;
    Возврат Неопределено;
КонецФункции

&НаСервере
Функция ПроекИзДокументаЗаказа(Док)

	Возврат Док.Проект;	

КонецФункции

&НаСервере
Функция ОрганизацияИзДокументаЗаказа(Док)

	Возврат Док.Организация;	

КонецФункции

&НаСервере
Функция РедактироватьДокументыЗаданияНаРаботуСервер()
	
	ОбрОбъект = РеквизитФормыВЗначение("Объект");
	
	Возврат ОбрОбъект.РедактироватьДокументыЗаданияНаРаботу(ВыгрузитьДеревоЗначенийВТаблицуЗначений(РеквизитФормыВЗначение("ДеревоЗначений")));	
	
КонецФункции

&НаКлиенте
Процедура ЗаменаЗначенияНаДругого(СтрокаТабличнойЧасти, ТекущиеДанные)
	
	Для каждого ТекСтрока Из ТекущиеДанные Цикл
		ТекСтрока.Сотрудник             = СтрокаТабличнойЧасти.Сотрудник;
		
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЗаказПокупателя) Тогда 
			ТекСтрока.ЗаказПокупателя = СтрокаТабличнойЧасти.ЗаказПокупателя;
		КонецЕсли;
		
		ПРКТ = ПроекИзДокументаЗаказа(СтрокаТабличнойЧасти.ЗаказПокупателя);
		Если ЗначениеЗаполнено(ПРКТ) Тогда 
			ТекСтрока.ЗаказПокупателяПроект = ПРКТ;
		КонецЕсли;

		ТекСтрока.Статус = Истина;
		Если ТекСтрока.ПолучитьЭлементы().Количество() <> 0 Тогда
			ЗаменаЗначенияНаДругого(СтрокаТабличнойЧасти, ТекСтрока.ПолучитьЭлементы());	
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ОбновлениеИтога(ТекСтрока, НМ)
                                                                	
	ф = ДеревоЗначений.НайтиПоИдентификатору(ТекСтрока);	
	ДЗначений = РеквизитФормыВЗначение("ДеревоЗначений");
	
	ЗНЧ = НайтиСтрокуВДереве(ДЗначений.Строки, НМ);
	ОбновлениеИтогаПоРодителью(ЗНЧ.Родитель);
	
	ЗначениеВРеквизитФормы(ДЗначений, "ДеревоЗначений");
	
КонецПроцедуры

&НаСервере
Функция НайтиСтрокуВДереве(ДЗначений, НМ)

	ЗНЧ = Неопределено;
	
	Для каждого ТекСтрока Из ДЗначений Цикл
		Если ТекСтрока.НМ = НМ Тогда 
			Возврат ТекСтрока;
		Иначе 
			ЗНЧ = НайтиСтрокуВДереве(ТекСтрока.Строки, НМ);
			Если ЗНЧ <> Неопределено И ЗНЧ.НМ = НМ Тогда
				Возврат ЗНЧ;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат ЗНЧ;
	
КонецФункции

&НаСервере
Процедура ОбновлениеИтогаПоРодителью(Родитель)

	Родитель.ЗагрузкаПлан = Родитель.Строки.Итог("ЗагрузкаПлан");
	Если Не Родитель.Родитель = Неопределено Тогда 
		ОбновлениеИтогаПоРодителью(Родитель.Родитель);
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ОбновитКолонкуРазница()

	Дерево = РеквизитФормыВЗначение("ДеревоЗначений");
	
	Для каждого ТекДерево Из Дерево.Строки Цикл
		КешТариф      = Новый Соответствие;
		КешТарифЗаЧас = Новый Соответствие;
		Для каждого ТекДерево2 Из ТекДерево.Строки Цикл
			ТекДерево2.ТарифПоОрг         = ТекДерево2.Строки[0].ТарифПоОрг;
			ТекДерево2.ТарифЗаЧас         = ТекДерево2.Строки[0].ТарифЗаЧас; 
			//ТекДерево2.Тариф              = ТекДерево2.Строки[0].Тариф;
			ТекДерево2.ЗагрузкаПланВСумме    = ТекДерево2.ТарифЗаЧас * ТекДерево2.ЗагрузкаПлан;
			ТекДерево2.ЗаказПокупателяПроект = ТекДерево2.Строки[0].ЗаказПокупателяПроект;
			ТекДерево2.Организация           = ТекДерево2.Строки[0].Организация;
			ТекДерево2.РазницаВСумме 	     = ТекДерево2.ЗагрузкаПланВСумме - ТекДерево2.ТарифПоОрг; 
			
			КешТариф.Вставить(ТекДерево2.Организация, ТекДерево2.ТарифПоОрг);
			КешТарифЗаЧас.Вставить(ТекДерево2.Организация, ТекДерево2.ТарифЗаЧас);
		КонецЦикла;
		
		ТекДерево.ТарифПоОрг         = ИтогИзКеша(КешТариф);
		ТекДерево.ТарифЗаЧас         = ИтогИзКеша(КешТарифЗаЧас);
		//ТекДерево.ТарифЗаЧас    	 = ТекДерево.Строки[0].ТарифЗаЧас;
		//ТекДерево.Тариф              = ТекДерево.Строки[0].Тариф;
		ТекДерево.ЗагрузкаПланВСумме = ТекДерево.ТарифЗаЧас * ТекДерево.ЗагрузкаПлан;   
		ТекДерево.РазницаВСумме 	 = ТекДерево.ЗагрузкаПланВСумме - ТекДерево.ТарифПоОрг;		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоЗначений");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТаблицаМодифицированно()

	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " *";

КонецПроцедуры

&НаКлиенте
Процедура СнятьТаблицаМодифицированно()

	ЭтаФорма.Заголовок = СтрЗаменить(ЭтаФорма.Заголовок, "*", ""); 

КонецПроцедуры

&НаСервере
Функция ИтогИзКеша(Кеш)

	Сумма = 0;
	Для каждого ТекСтрока Из Кеш Цикл
		Сумма = Сумма + ТекСтрока.Значение;			
	КонецЦикла;	
	Возврат Сумма;

КонецФункции

&НаСервере
Функция Обработка(Кеш)

	Изменен = Ложь;
	КРЧ = Справочники.AzRyНастройки.КоличествоРабочихЧасов.Значение;
	
	Для каждого ТекСтрока Из Кеш Цикл
		// Tu dro romelic unda gadanawildes ar arsebobs mashin gamovdivart
		Если ТекСтрока.Значение.СПЗначений1.Количество() = 0 Тогда 
			Продолжить;
		Иначе
			// Tu gadasanawilebeli dro aris magram sad gadanawildes isini ar arseboben mashin shemdegze gadavdivarT
			Если ТекСтрока.Значение.СПЗначений2.Количество() = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			СПЗначений1 = ТекСтрока.Значение["СПЗначений1"];
			СПЗначений2 = ТекСтрока.Значение["СПЗначений2"];
			
			Парам = СуммаИДокументыЗадНаРаботу(СПЗначений1);
			
			СуммаВремени = Парам.СуммаВремени;
			ИзбытокСумма = 0;
			Избыток      = 0;
			Для каждого ТекОргПрием Из СПЗначений2 Цикл
				
				// For debug --
				//Если ТекОргПрием.Значение.ОрганизацияЗаданияНаРаботу = Справочники.Организации.НайтиПоКоду("00-000004") Тогда Продолжить; КонецЕсли;	
								
				ЗагрузкаПланТребуетсяДобавитьОстаток = 0;
				
				// Tu Organizacias gegmiuri saatebi gadavsebuli aqvs, mashin gadavdivart shemdeg organizaciaze 
				Если ТекОргПрием.Значение.ЗагрузкаПланТребуетсяДобавить <= 0 Тогда Продолжить; КонецЕсли;
				
				ЗагрузкаПланТребуетсяДобавитьОстаток = ТекОргПрием.Значение.ЗагрузкаПланТребуетсяДобавить;
				
				Для каждого ТекДерегоОтдача Из Парам.Массив Цикл
					
					Если ЗагрузкаПланТребуетсяДобавитьОстаток = 0 Тогда Продолжить; КонецЕсли;
					
					// Tu xelfasi shevsebulia eseigi oranizaciis sheсvla am worklogze ukve ganxorcielda
					Если Не ТекДерегоОтдача.ТарифПоОрг = 0 Тогда Продолжить; КонецЕсли;
					
					Если ТекДерегоОтдача.ЗагрузкаПлан <= ЗагрузкаПланТребуетсяДобавитьОстаток Тогда 
						ТекДерегоОтдача.ОрганизацияЗаданияНаРаботу = ТекОргПрием.Значение.ОрганизацияЗаданияНаРаботу;
						ЗагрузкаПланТребуетсяДобавитьОстаток = ЗагрузкаПланТребуетсяДобавитьОстаток - ТекДерегоОтдача.ЗагрузкаПлан;
						ТекДерегоОтдача.Статус               = Истина; 
						ТекДерегоОтдача.ТарифПоОрг           = ТекОргПрием.Значение.ТарифПоОрг;
						Изменен = Истина;
						Если ИзбытокСумма <> 0 Тогда 
							ПерераспределитьВремя(ИзбытокСумма, ТекДерегоОтдача.ЗагрузкаПлан);
						КонецЕсли;	
					Иначе
						Избыток = (ТекДерегоОтдача.ЗагрузкаПлан - ЗагрузкаПланТребуетсяДобавитьОстаток);
						ИзбытокСумма = ИзбытокСумма + Избыток;
						ТекДерегоОтдача.ОрганизацияЗаданияНаРаботу = ТекОргПрием.Значение.ОрганизацияЗаданияНаРаботу;
						ТекДерегоОтдача.ЗагрузкаПлан 		 = ЗагрузкаПланТребуетсяДобавитьОстаток;
						ЗагрузкаПланТребуетсяДобавитьОстаток = 0;
						ТекДерегоОтдача.Статус               = Истина;
						ТекДерегоОтдача.ТарифПоОрг           = ТекОргПрием.Значение.ТарифПоОрг;
						Изменен = Истина;
					КонецЕсли;	
										
				КонецЦикла;		
			КонецЦикла;		
		КонецЕсли;		
	КонецЦикла;	
	
	Возврат Изменен;
	
КонецФункции

&НаСервере
Функция Обработка2(Кеш)

	НачатьТранзакцию();
	
	Попытка
		
		Изменен = Ложь;
		КРЧ = Справочники.AzRyНастройки.КоличествоРабочихЧасов.Значение;
		
		Для каждого ТекСтрока Из Кеш Цикл
			// Tu dro romelic unda gadanawildes ar arsebobs mashin gamovdivart
			Если ТекСтрока.Значение.СПЗначений1.Количество() = 0 Тогда 
				Продолжить;
			Иначе
				// Tu gadasanawilebeli dro aris magram sad gadanawildes isini ar arseboben mashin shemdegze gadavdivarT
				Если ТекСтрока.Значение.СПЗначений2.Количество() = 0 Тогда 
					Продолжить;
				КонецЕсли;
				
				СПЗначений1 = ТекСтрока.Значение["СПЗначений1"];
				СПЗначений2 = ТекСтрока.Значение["СПЗначений2"];
				
				Парам = СуммаИДокументыЗадНаРаботу2(СПЗначений1);
				
				Для каждого ТекОрг Из Парам Цикл
					
					СуммаВремени = ТекОрг.Значение.СуммаВремени;
					ИзбытокСумма = 0;
					Избыток      = 0;
					Массив       = ТекОрг.Значение.Массив;
					Для каждого ТекОргПрием Из СПЗначений2 Цикл
						
						// For debug --
						//Если ТекОргПрием.Значение.ОрганизацияЗаданияНаРаботу = Справочники.Организации.НайтиПоКоду("11-000001") Тогда Продолжить; КонецЕсли;	
						
						Если СуммаВремени = 0 Тогда Продолжить; КонецЕсли;
						
						Если СуммаВремени <= ТекОргПрием.Значение.ЗагрузкаПланТребуетсяДобавить Тогда 
							ТекОргПрием.Значение.ЗагрузкаПланТребуетсяДобавить = СуммаВремени;	
						КонецЕсли;				
						
						ЗагрузкаПланТребуетсяДобавитьОстаток = 0;
						
						//// Tu Organizacias gegmiuri saatebi gadavsebuli aqvs, mashin gadavdivart shemdeg organizaciaze 
						//Если ТекОргПрием.Значение.ЗагрузкаПланТребуетсяДобавить <= 0 Тогда Продолжить; КонецЕсли;
						
						ЗагрузкаПланТребуетсяДобавитьОстаток = ТекОргПрием.Значение.ЗагрузкаПланТребуетсяДобавить;
						
						Для Ч = 0 По Массив.Количество() - 1 Цикл						
							//Для каждого ТекМассив Из ТекДерегоОтдача.Значение Цикл
							
							Если ЗагрузкаПланТребуетсяДобавитьОстаток = 0 Тогда Продолжить; КонецЕсли;
							
							// Tu manamde am chanawerze moxda chasworeba mashin gadavidet sxvaze
							Если Массив[Ч].Изменен Тогда Продолжить; КонецЕсли;
							
							Если (ЗагрузкаПланТребуетсяДобавитьОстаток - Массив[Ч].ЗагрузкаПлан) < 0 Тогда
								С   = Массив[Ч].ЗагрузкаПлан - ЗагрузкаПланТребуетсяДобавитьОстаток;
								Нов = Массив[Ч].ЗагрузкаПлан - С;
								Массив[Ч].Статус                     = Истина;
								Массив[Ч].ЗагрузкаПлан               = С;
								СозданиеДокументаЗаданиеНаРаботу(Нов, ТекОргПрием.Значение, Массив[Ч].ЗаказПокупателя, Массив[Ч].ЗаказПокупателяПроект);
								СуммаВремени                         = СуммаВремени - Нов;
								ЗагрузкаПланТребуетсяДобавитьОстаток = 0;
								Изменен = Истина;
								Массив[Ч].Изменен = Истина;
							Иначе 	
								Массив[Ч].ОрганизацияЗаданияНаРаботу = ТекОргПрием.Значение.ОрганизацияЗаданияНаРаботу;
								ЗагрузкаПланТребуетсяДобавитьОстаток = ЗагрузкаПланТребуетсяДобавитьОстаток - Массив[Ч].ЗагрузкаПлан;
								СуммаВремени                         = СуммаВремени - Массив[Ч].ЗагрузкаПлан;
								Массив[Ч].Статус                     = Истина; 
								Массив[Ч].ТарифПоОрг                 = ТекОргПрием.Значение.ТарифПоОрг;
								Изменен = Истина;
								Массив[Ч].Изменен = Истина;
							КонецЕсли; 	
						КонецЦикла;		
					КонецЦикла;						
				КонецЦикла;
				
			КонецЕсли;		
		КонецЦикла;
		
	Исключение
		ОтменитьТранзакцию();
		Сообщить(ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;	
	
	ЗафиксироватьТранзакцию();
	
	Возврат Изменен;
	
КонецФункции

&НаСервере
Функция Обработка3(Кеш)
	
	НачатьТранзакцию();
	
	Попытка
		
		Изменен = Ложь;
		КРЧ = Справочники.AzRyНастройки.КоличествоРабочихЧасов.Значение;
		
		Для каждого ТекСтрока Из Кеш Цикл
			// Tu dro romelic unda gadanawildes ar arsebobs mashin gamovdivart
			Если ТекСтрока.Значение.СПЗначений1.Количество() = 0 Тогда 
				Продолжить;
			Иначе
				
				СПЗначений1 = ТекСтрока.Значение["СПЗначений1"];
				
				Для каждого ТекЗначение Из СПЗначений1 Цикл
								
					ТребуетсяДобавить = ТекЗначение.Значение.ЗагрузкаПланТребуетсяДобавить;
					СуммаПоПроектам   = СуммаПоПроектам(ТекЗначение.Значение.Строки);
					
					Если ЗначениеЗаполнено(ТекЗначение.Значение.ЗаказПокупателяНовый) Тогда				
						СозданиеДокументаПоМассиву(ТребуетсяДобавить, ТекЗначение, ТекЗначение.Значение.ЗаказПокупателяНовый);
					Иначе 
						М2 = МассивВремены(ТребуетсяДобавить, ТекЗначение.Значение); 
						Для каждого ТекПроект Из М2 Цикл					
							СозданиеДокументаПоМассиву(ТекПроект.Значение, ТекЗначение, ТекПроект.Ключ);
						КонецЦикла;										
					КонецЕсли;					
				КонецЦикла;                                      
			КонецЕсли;		
		КонецЦикла;	
		
	Исключение
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Изменен;
	
КонецФункции

&НаСервере
Функция СуммаИДокументыЗадНаРаботу(СПЗначений1)
	
	// TODO aq unda gaichitos mapi rogoricaa amdagvari funqciis meore versiashi (UKVE AGARAA SACHIRO)	
	СуммаВремени      = 0;
	КоличествоЗаписей = 0;
	Массив = Новый Массив;
	Структура = Новый Структура;
	Для каждого ТекЗначение Из СПЗначений1 Цикл
		Для каждого ТекДерего Из ТекЗначение.Значение.Строки Цикл
			Для каждого ТекДерего1 Из ТекДерего.Строки Цикл
				СуммаВремени            = СуммаВремени + ТекДерего1.ЗагрузкаПлан;
				//ТекДерего1.ЗагрузкаПлан = 0;
				//ТекДерего1.ЗагрузкаПланВСумме = 0;
				//ТекДерего1.Статус       = Истина;
				Массив.Добавить(ТекДерего1);	
				КоличествоЗаписей = КоличествоЗаписей + 1;
			КонецЦикла;	
		КонецЦикла; 			
	КонецЦикла;
	
	Структура.Вставить("СуммаВремени",      СуммаВремени);
	Структура.Вставить("КоличествоЗаписей", КоличествоЗаписей);
	Структура.Вставить("Массив",            Массив);
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция СуммаИДокументыЗадНаРаботу2(СПЗначений1)
	
	СуммаВремени      = 0;
	КоличествоЗаписей = 0;
	Массив = Новый Массив;
	Структура = Новый Структура;
	Мап = Новый Соответствие;
	Для каждого ТекЗначение Из СПЗначений1 Цикл
		П = Новый Структура;
		ЗагрузкаПлан          = ТекЗначение.Значение.ЗагрузкаПлан;
		ЗагрузкаПланТребуется = ТекЗначение.Значение.ЗагрузкаПланТребуется;
		СуммаВ = (ЗагрузкаПлан - ЗагрузкаПланТребуется);
	
		Для каждого ТекДерего Из ТекЗначение.Значение.Строки Цикл
			Для каждого ТекДерего1 Из ТекДерего.Строки Цикл				
				
				Если СуммаВ <= 0 Тогда Прервать; КонецЕсли;
				
				Если ТекДерего1.ЗагрузкаПлан <= СуммаВ Тогда
					СуммаВ = СуммаВ - ТекДерего1.ЗагрузкаПлан;
					Массив.Добавить(ТекДерего1);
				Иначе
					СуммаВ = СуммаВ - ТекДерего1.ЗагрузкаПлан;
					Массив.Добавить(ТекДерего1);
					Прервать;
				КонецЕсли;	
				
			КонецЦикла;	
		КонецЦикла;
		
		П.Вставить("СуммаВремени", (ЗагрузкаПлан - ЗагрузкаПланТребуется));
		П.Вставить("Массив", Массив);
		Мап.Вставить(ТекЗначение.Значение.ОрганизацияЗаданияНаРаботу, П);
	КонецЦикла;
		
	Возврат Мап;
	
КонецФункции
 
&НаСервере
Функция КешДляОбработки(СПЗначений, Парам)

	Кеш   = Новый Соответствие;
	Для каждого ТекСтрока Из СПЗначений Цикл
		П = Новый Структура;
		П.Вставить("ТарифПоОрг", ТекСтрока.Значение.ТарифПоОрг);
		П.Вставить("ЗаказПокупателя", ТекСтрока.Значение.ЗаказПокупателя);
		Кеш.Вставить(ТекСтрока.Значение.Организация, П);
	КонецЦикла;	
	
	Зарплата = 0;
	Для каждого ТекСтрока Из Кеш Цикл
		Зарплата = Зарплата + ТекСтрока.Значение.ТарифПоОрг;	
	КонецЦикла;
	
	СТРП = Новый Структура;
	Если Цел(Парам.КоличествоЗаписей / Кеш.Количество()) = 0 Тогда
		
		КО = Кеш.Количество();	
		Для Х=0 По Кеш.Количество()-1 Цикл
			Ц = ?(КО = 0, 0, Цел(Парам.КоличествоЗаписей / КО));
			СТРП.Вставить("П"+Х, ?(Ц=0, 0, 1));	
			КО = КО - 1;
		КонецЦикла;
	Иначе 
		
		КО   = Кеш.Количество();
		КОЛЗ = Парам.КоличествоЗаписей;
		Цел  = Цел(Парам.КоличествоЗаписей / КО);
		Для Х=0 По Кеш.Количество()-1 Цикл
			СТРП.Вставить("П"+Х, ?(Х=(Кеш.Количество()-1), КОЛЗ, Цел));
			КОЛЗ = КОЛЗ - Цел;
		КонецЦикла;	
	КонецЕсли;			
	
	К = Зарплата / 100;
	Н1 = 0;
	Н2 = 0;
	//Стр = Новый Структура;
	Для каждого ТекСтрока Из Кеш Цикл
		ТекСтрока.Значение.Вставить("Процент", ТекСтрока.Значение.ТарифПоОрг / К); 
		ТекСтрока.Значение.Вставить("СуммаВремени", Окр((Парам.СуммаВремени / 100) * (ТекСтрока.Значение.ТарифПоОрг / К), 4));
		
		НовМассив = Новый Массив;
		Для Ч=0 По СТРП["П"+Н1]-1 Цикл		
			НовМассив.Добавить(Парам.Массив.Получить(Ч+Н2));	
		КонецЦикла;
		//Стр.Вставить("П"+Н1, НовМассив);
		ТекСтрока.Значение.Вставить("МассивДок", НовМассив);
		Н2 = Н2 + Ч;
		Н1 = Н1 + 1;
	КонецЦикла;
	
	
	Возврат Кеш;

КонецФункции

&НаСервере
Процедура ОбработкаТаблицы(ТЗ)

	// 1)
	Для каждого ТекСтрока Из ТЗ Цикл
		Если ТекСтрока.Сотрудник = Null Тогда
			ТекСтрока.Сотрудник       		= ТекСтрока.Сотрудник1;
			//ТекСтрока.Организация     		= ТекСтрока.Организация1;
			ТекСтрока.ОрганизацияЗаданияНаРаботу = ТекСтрока.Организация1;
			ТекСтрока.ЗаказПокупателя 		= Документы.ЗаказПокупателя.ПустаяСсылка();
			ТекСтрока.ЗагрузкаПлан    		= 0;
			ТекСтрока.ЗагрузкаПланВСумме    = 0;
			ТекСтрока.ЗаказПокупателяПроект = Справочники.Проекты.ПустаяСсылка();
			ТекСтрока.Налог                 = Справочники.ВидыНачисленийИУдержаний.ПустаяСсылка();
			ТекСтрока.РазницаВСумме         = 0;
			ТекСтрока.Статус                = Ложь;
			ТекСтрока.Тариф                 = 0;
			ТекСтрока.ТарифЗаЧас            = 0;
			ТекСтрока.ТарифПоОрг            = ТекСтрока.Сумма1;
			ТекСтрока.Строка                = "Строка";
		КонецЕсли; 	
	КонецЦикла;
	
	// 2)
	
	ТЗ2 = ТЗ.Скопировать();
	ТЗ2.Свернуть("Сотрудник, ОрганизацияЗаданияНаРаботу, ТарифПоОрг", "ЗагрузкаПлан");
	ТЗ2.Свернуть("Сотрудник", "ТарифПоОрг, ЗагрузкаПлан");
	
	// 3) 
	ТЗ.Колонки.Добавить("НМ", Новый ОписаниеТипов("Строка", Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный)));
	Для Ч=0 По ТЗ.Количество()-1 Цикл
		НайденнаяСтрока = ТЗ2.Найти(ТЗ[Ч].Сотрудник, "Сотрудник");
		
		ТЗ[Ч].НМ = Ч;
		О = Окр(НайденнаяСтрока.ТарифПоОрг / НайденнаяСтрока.ЗагрузкаПлан, 4);
		ТЗ[Ч].ТарифЗаЧас            = О;
		ТЗ[Ч].ЗагрузкаПланВСумме    = Окр(ТЗ[Ч].ЗагрузкаПлан * О, 4);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РаспределитьВремяВМассив(КолЗаписей, Время)

	К = Окр(Время / КолЗаписей, 2);
	Сумма = 0;
	Массив = Новый Массив;
	Для Ч = 0 По КолЗаписей - 1 Цикл
		Если Ч = (КолЗаписей - 1) Тогда 
			С = Время - Сумма;
			Массив.Добавить(С);
		Иначе 
			Массив.Добавить(К);
			Сумма = Сумма + К;			
		КонецЕсли;			
	КонецЦикла;
	
	Возврат Массив;

КонецФункции

&НаСервере
Функция СуммаПоПроектам(Строки)

	Сумма = 0;
	Для каждого ТекСтрока Из Строки Цикл
		Сумма = Сумма + ТекСтрока.ЗагрузкаПлан;		
	КонецЦикла;
	
	Возврат Сумма;
	
КонецФункции // СуммаПоПроектам()

&НаСервере
Функция СозданиеДокументаЗаданиеНаРаботу(Времья, ТекЗначение, ЗакаПокупателя = Неопределено, Проект = Неопределено)
	
	// Документ "Задание На Работу"
	НовыйДокумент = Документы.ЗаданиеНаРаботу.СоздатьДокумент();
	НовыйДокумент.Номер = УННомер(НовыйДокумент.Номер);
	НовыйДокумент.Дата = Объект.ДатаОтбора;
	НовыйДокумент.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	НовыйДокумент.Организация    = ТекЗначение.ОрганизацияЗаданияНаРаботу;
	НовыйДокумент.ВидОперации    = Перечисления.ВидыОперацийЗаданиеНаРаботу.Внешнее;
	НовыйДокумент.ВидРабот       = Справочники.AzRyНастройки.ЗаданиеНаРаботуВидРабот.Значение;
	НовыйДокумент.Состояние      = Справочники.СостоянияСобытий.Завершено;
	НовыйДокумент.Сотрудник      = ТекЗначение.Сотрудник;
	НовыйДокумент.Комментарий    = "Local";	
	
	// Табличная часть документа
	СгенерироватьТЗДокументаЗаданиеНаРаботу(ТекЗначение, НовыйДокумент, Времья, ЗакаПокупателя, Проект);

	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);	
			
КонецФункции

&НаСервере
Функция СоздатьМассивИтерацийИзВремены(Время)

	В = Время;
	К = Время / 24; 
	С = Цел(К)+1;
	Массив = Новый Массив;
	Для Ч = 0 По С-1 Цикл
		Если Ч = (С - 1) Тогда  
			Массив.Добавить(В);
		Иначе 
			Массив.Добавить(24);
			В = В - 24;
		КонецЕсли;		
	КонецЦикла;

	Возврат Массив;
	
КонецФункции

&НаСервере
Процедура СгенерироватьТЗДокументаЗаданиеНаРаботу(ТекСтрока, НовыйДокумент, Времья, ЗакаПокупателя, Проект = Неопределено)
	
	ДТ = НовыйДокумент.Дата;
	ЗПНоменклатура = Справочники.Номенклатура.НайтиПоКоду("11-00001636");
	
	НоваяСтрока = НовыйДокумент.Работы.Добавить(); 	
	НоваяСтрока.Заказчик       = ЗакаПокупателя;
	НоваяСтрока.AzRyПроект     = Проект;
	НоваяСтрока.ВидРабот       = Справочники.AzRyНастройки.ЗаданиеНаРаботуВидРабот.Значение;  
	НоваяСтрока.Номенклатура   = ЗПНоменклатура; 
	НоваяСтрока.ДатаНачала     = Дата(Год(ДТ),Месяц(ДТ),День(ДТ),10,00,00);
	НоваяСтрока.ДатаОкончания  = НоваяСтрока.ДатаНачала + Времья * 3600;
	НоваяСтрока.Трудоемкость   = Времья;		
	
КонецПроцедуры

&НаСервере
Процедура ПерераспределитьВремя(ИзбытокСумма, ЗагрузкаПлан)

	Если (ЗагрузкаПлан + ИзбытокСумма) > 24 Тогда 
		К = ((ЗагрузкаПлан + ИзбытокСумма) - 24);
		ЗагрузкаПлан = ЗагрузкаПлан + К;
		ИзбытокСумма = ИзбытокСумма - К;	
	Иначе 
		ЗагрузкаПлан = ЗагрузкаПлан + ИзбытокСумма;
		ИзбытокСумма = 0;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция МассивВремены(Время, ДерегоЗначения)
		
	К = ?(ДерегоЗначения.ЗагрузкаПлан = 0, 1, (ДерегоЗначения.ЗагрузкаПланТребуетсяДобавить / ДерегоЗначения.ЗагрузкаПлан));
	
	Количество = ДерегоЗначения.Строки.Количество();
	
	М = Новый Массив;
	Соот = Новый Соответствие;
	Сумма = 0;	
	Для Ч = 0 По Количество-1 Цикл
		
		Если (Не ЗначениеЗаполнено(ДерегоЗначения.Строки[Ч].ЗаказПокупателя)) Тогда 
			ВызватьИсключение "თანამშრომელს (" + ДерегоЗначения.Строки[Ч].Сотрудник + ") არ აქვს მითითებული მყიდველის შეკვეთა."; 
		КонецЕсли;
		
		Если Ч = Количество-1 Тогда
			Соот.Вставить(ДерегоЗначения.Строки[Ч].ЗаказПокупателя, Окр(Время-Сумма, 2));
		Иначе 	
			Сумма = Сумма + Окр((ДерегоЗначения.Строки[Ч].ЗагрузкаПлан * К), 2);
			Соот.Вставить(ДерегоЗначения.Строки[Ч].ЗаказПокупателя, Окр((ДерегоЗначения.Строки[Ч].ЗагрузкаПлан * К), 2));
		КонецЕсли; 	
	КонецЦикла;
	
	Возврат Соот;

КонецФункции

&НаСервере
Процедура СозданиеДокументаПоМассиву(Время, ТекЗначение, ТекПроект) 
	
	М3 = СоздатьМассивИтерацийИзВремены(Время);					
	Для каждого ТекВремя Из М3 Цикл
		СозданиеДокументаЗаданиеНаРаботу(ТекВремя, ТекЗначение.Значение, ТекПроект);	
	КонецЦикла;
	
КонецПроцедуры

Функция СуммаТарифаПоОрганизациям(ТекДерево)

	ЗагрузкаПлан = 0;
	Сумма = 0;
	Для каждого ТекДерево1 Из ТекДерево.Строки Цикл // ორგანიზაციის ციკლი
		
		Сумма = Сумма + ?(ТекДерево1.Строки[0].Строки[0].ТарифПоОрг = Null, 0, ТекДерево1.Строки[0].Строки[0].ТарифПоОрг);
		ЗагрузкаПлан = ЗагрузкаПлан + ТекДерево1.ЗагрузкаПлан;

	КонецЦикла;

	Возврат Сумма / ЗагрузкаПлан;
	
КонецФункции 
 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Объект.ДатаОтбора = Дата(2011, 9, 1);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура Сформировать(Команда)
	ОчиститьСообщения();
	СформироватьНаСервер();
	СнятьТаблицаМодифицированно();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	СохранениеДанныхWorklogsРазница();
	СоздатьДокументыСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьРазличияWorklogs(Команда)
	СохранениеДанныхWorklogsРазница();
КонецПроцедуры

&НаКлиенте
Процедура НачислитьЗарплату(Команда)
	
	ОчиститьСообщения();
	
	Если ДатаОбновленияДокументаНачисленийОт = Дата(1,1,1) Или ДатаОбновленияДокументаНачисленийДо = Дата(1,1,1) Тогда 
		Сообщить("Поле дата обновления докумнта начислений пустая.");
	Иначе 
		ОбновытДокНачислениеИУдержаниеСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьДокументыЗаданияНаРаботу(Команда)
	
	Ответ = РедактироватьДокументыЗаданияНаРаботуСервер();
	Если Ответ Тогда	
		СнятьТаблицаМодифицированно();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьЗагрузкаПланПоОрганизациямЕтап1(Команда)
	
	// 1) Change
	Изменен = Ложь;
	РаспределитьЗагрузкаПланПоОрганизациямЕтап1НаСервере(Изменен);	
	Если Изменен Тогда 
		УстановитьТаблицаМодифицированно();	
	КонецЕсли;
	
	// 2) Save
	Ответ = РедактироватьДокументыЗаданияНаРаботуСервер();
	Если Ответ Тогда	
		СнятьТаблицаМодифицированно();
	КонецЕсли;
	
	// 3) Select
	ОчиститьСообщения();
	СформироватьНаСервер();
	СнятьТаблицаМодифицированно();
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьЗагрузкаПланПоОрганизациямЕтап1НаСервере(Изменен)
	
	Дерево = РеквизитФормыВЗначение("ДеревоЗначений");
	
	Кеш = Новый Соответствие;
	Для каждого ТекСтрока Из Дерево.Строки Цикл
		
		СПЗначений1 = Новый СписокЗначений;
		СПЗначений2 = Новый СписокЗначений;
		Структура   = Новый Структура;
		Для каждого ТекСтрока2 Из ТекСтрока.Строки Цикл
			
			//Если ТекСтрока2.ЗагрузкаПлан = 0 Тогда Продолжить; КонецЕсли;
			Если ТекСтрока2.ТарифПоОрг = 0 Тогда
				СПЗначений1.Добавить(ТекСтрока2);	
			Иначе
				СПЗначений2.Добавить(ТекСтрока2);	
			КонецЕсли;	
			
		КонецЦикла;
		
		Структура.Вставить("СПЗначений1", СПЗначений1);
		Структура.Вставить("СПЗначений2", СПЗначений2);
		
		Кеш.Вставить(ТекСтрока.Сотрудник, Структура);
		
	КонецЦикла;
	
	// 2)
	Изменен = Обработка(Кеш);
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоЗначений");	
	
	ТЗ = ВыгрузитьДеревоЗначенийВТаблицуЗначений(Дерево);
	
	РеквизитФормыВЗначение("Объект").ФилтрТЗ1(ТЗ, "НМ", 0);
	СформироватьСервер(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьЗагрузкаПланПоОрганизациямЕтап2(Команда)
	
	// 1) Change
	Изменен = Ложь;
	РаспределитьЗагрузкаПланПоОрганизациямЕтап2НаСервере(Изменен);	
	Если Изменен Тогда 
		УстановитьТаблицаМодифицированно();	
	КонецЕсли;
	
	// 2) Save
	Ответ = РедактироватьДокументыЗаданияНаРаботуСервер();
	Если Ответ Тогда	
		СнятьТаблицаМодифицированно();
	КонецЕсли;
	
	// 3) Select
	ОчиститьСообщения();
	СформироватьНаСервер();
	СнятьТаблицаМодифицированно();

КонецПроцедуры

&НаСервере
Процедура РаспределитьЗагрузкаПланПоОрганизациямЕтап2НаСервере(Изменен)
	
	Дерево = РеквизитФормыВЗначение("ДеревоЗначений");
	
	Кеш = Новый Соответствие;
	Для каждого ТекСтрока Из Дерево.Строки Цикл
		
		СПЗначений1 = Новый СписокЗначений;
		СПЗначений2 = Новый СписокЗначений;
		Структура   = Новый Структура;
		Для каждого ТекСтрока2 Из ТекСтрока.Строки Цикл
			
			Если Окр(ТекСтрока2.ЗагрузкаПланТребуетсяДобавить, 2) < 0 Тогда
				СПЗначений1.Добавить(ТекСтрока2);	
			Иначе
				Если Окр(ТекСтрока2.ЗагрузкаПланТребуетсяДобавить, 2) > 0 Тогда
					СПЗначений2.Добавить(ТекСтрока2);				
				КонецЕсли; 	
			КонецЕсли;	
			
		КонецЦикла;
		
		Структура.Вставить("СПЗначений1", СПЗначений1);
		Структура.Вставить("СПЗначений2", СПЗначений2);
		
		Кеш.Вставить(ТекСтрока.Сотрудник, Структура);
		
	КонецЦикла;
	
	// 2)
	Изменен = Обработка2(Кеш);
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоЗначений");
	
	ТЗ = ВыгрузитьДеревоЗначенийВТаблицуЗначений(Дерево);
	
	РеквизитФормыВЗначение("Объект").ФилтрТЗ1(ТЗ, "Регистратор", Документы.ЗаданиеНаРаботу.ПустаяСсылка());
	СформироватьСервер(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьЗагрузкаПланПоОрганизациямЕтап3(Команда)
	
	// 1) Change
	Изменен = Ложь;
	РаспределитьЗагрузкаПланПоОрганизациямЕтап3НаСервере(Изменен);	
	Если Изменен Тогда 
		УстановитьТаблицаМодифицированно();
	Иначе 
		СнятьТаблицаМодифицированно();
	КонецЕсли;	
	
	// 2) Save
	Ответ = РедактироватьДокументыЗаданияНаРаботуСервер();
	Если Ответ Тогда	
		СнятьТаблицаМодифицированно();
	КонецЕсли;
	
	// 3) Select
	ОчиститьСообщения();
	СформироватьНаСервер();
	СнятьТаблицаМодифицированно();
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьЗагрузкаПланПоОрганизациямЕтап3НаСервере(Изменен)
	
	Дерево = РеквизитФормыВЗначение("ДеревоЗначений");
	
	Кеш = Новый Соответствие;
	Для каждого ТекСтрока Из Дерево.Строки Цикл
		
		СПЗначений1 = Новый СписокЗначений;
		Структура   = Новый Структура;
		Для каждого ТекСтрока2 Из ТекСтрока.Строки Цикл
			
			Если Окр(ТекСтрока2.ЗагрузкаПланТребуетсяДобавить, 2) > 0 Тогда
				СПЗначений1.Добавить(ТекСтрока2);		
			КонецЕсли;	
			
		КонецЦикла;
		
		Структура.Вставить("СПЗначений1", СПЗначений1);
		
		Кеш.Вставить(ТекСтрока.Сотрудник, Структура);
		
	КонецЦикла;
	
	// 2)
	Изменен = Обработка3(Кеш);
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоЗначений");	
	
	Изменен = Ложь;
	СформироватьСервер();
	
КонецПроцедуры

&НаСервере
Функция ДеревоЗначенийЗаказПокупателяНовыйОбработкаВыбораСервер(ЗаказПокупателя)

	
	
	Возврат Ложь;

КонецФункции
 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ДатаОтбораПриИзменении(Элемент)
	
	ДатаОбновленияДокументаНачисленийОт = НачалоМесяца(Объект.ДатаОтбора);
	ДатаОбновленияДокументаНачисленийДо = КонецМесяца(Объект.ДатаОтбора);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТАБЛИЧНОГО ПОЛЯ "ДеревоЗначений"

&НаКлиенте
Процедура ДеревоЗначенийСотрудникПриИзменении(Элемент)
	
	//СтрокаТабличнойЧасти = Элементы.ДеревоЗначений.ТекущиеДанные;
	//СтрокаТабличнойЧасти.Статус = Истина;
	//
	//Если Элементы.ДеревоЗначений.ТекущиеДанные.ПолучитьЭлементы().Количество() <> 0 Тогда 
	//	ЗаменаЗначенияНаДругого(СтрокаТабличнойЧасти, Элементы.ДеревоЗначений.ТекущиеДанные.ПолучитьЭлементы());	
	//КонецЕсли;			
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗначенийЗаказПокупателяПриИзменении(Элемент)
	
 //   СтрокаТабличнойЧасти = Элементы.ДеревоЗначений.ТекущиеДанные;
 //
 //   СтрокаТабличнойЧасти.Статус = Истина;
 //   СтрокаТабличнойЧасти.ЗаказПокупателяПроект = ПроекИзДокументаЗаказа(СтрокаТабличнойЧасти.ЗаказПокупателя);
 //   
 //   Если Элементы.ДеревоЗначений.ТекущиеДанные.ПолучитьЭлементы().Количество() <> 0 Тогда 
 //   	ЗаменаЗначенияНаДругого(СтрокаТабличнойЧасти, Элементы.ДеревоЗначений.ТекущиеДанные.ПолучитьЭлементы());	
 //   КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗначенийЗагрузкаПланПриИзменении(Элемент)
	
	//СтрокаТабличнойЧасти = Элементы.ДеревоЗначений.ТекущиеДанные;
	//СтрокаТабличнойЧасти.ЗагрузкаПланВСумме = СтрокаТабличнойЧасти.ТарифЗаЧас * СтрокаТабличнойЧасти.ЗагрузкаПлан; 
	//СтрокаТабличнойЧасти.Статус = Истина;
	//ОбновлениеИтога(Элементы.ДеревоЗначений.ТекущаяСтрока, СтрокаТабличнойЧасти.НМ);
	//ОбновитКолонкуРазница();
	//
	//УстановитьТаблицаМодифицированно();
	
КонецПроцедуры 

&НаКлиенте
Процедура ДеревоЗначенийЗаказПокупателяНовыйОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Элементы.ДеревоЗначений.ТекущиеДанные.ОрганизацияЗаданияНаРаботу) Тогда
		СтандартнаяОбработка = Ложь;
	Иначе 	
		Если ЗначениеЗаполнено(Элементы.ДеревоЗначений.ТекущиеДанные.ЗаказПокупателя) Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли; 	
	КонецЕсли; 
КонецПроцедуры


Функция УННомер(Н)

	НС = "AR00-JR99999";
	Ч = 0;
	Для Х = 1 По 99999 Цикл
		
		НомерД = Лев(Н, 7) + Формат(Х, "ЧЦ=5; ЧВН=; ЧГ=");
		
		Если ЗапросУнНомер(НомерД) Тогда 
			Возврат НомерД;
		КонецЕсли;	
	
	КонецЦикла;

	Возврат НС;
	
КонецФункции

Функция ЗапросУнНомер(НомерД)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаРаботу.Номер,
		|	ЗаданиеНаРаботу.Ссылка
		|ИЗ
		|	Документ.ЗаданиеНаРаботу КАК ЗаданиеНаРаботу
		|ГДЕ
		|	ЗаданиеНаРаботу.Номер = &Номер";

	Запрос.УстановитьПараметр("Номер", НомерД);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 0 Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;

КонецФункции 
 
 

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
